6-12-2018/grzesiek/super-blog-grzesiek/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Another post"], ["content", "lalala"], ["user_id", 1], ["created_at", "2018-12-07 08:45:34.393175"], ["updated_at", "2018-12-07 08:45:34.393175"]]
---
  def create
    post = Post.new(post_params)

    post.user = current_user

    if post.save