6-12-2018/grzesiek/super-blog-grzesiek/app/controllers/user_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" != $1  [["user_id", 2]]
---
  def profile
    @user_posts = Post.where(user_id: current_user)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def nick
    @user = User.find(current_user.id)

UPDATE "users" SET "nick" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["nick", "Greg"], ["updated_at", "2018-12-07 13:33:46.335922"], ["id", 1]]
---
  def add_nick
    current_user.update(user_params)