6-12-2018/przemek/super-blog-przemek/app/controllers/comments_controller.rb

  def create
    post = Post.find(params[:post_id])
    @comment = Comment.new(comment_params)
    @comment.user = current_user
    @comment.post = post

    @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "xddddd"], ["post_id", 3], ["user_id", 1], ["created_at", "2018-12-07 11:52:45.976069"], ["updated_at", "2018-12-07 11:52:45.976069"]]