6-12-2018/przemek/super-blog-przemek/app/controllers/home_controller.rb

  def index
    @posts = Post.where(published: true).this_month
---
SELECT "posts".* FROM "posts" WHERE "posts"."published" = $1 AND (created_at BETWEEN '2018-11-07 11:09:09.118912' AND '2018-12-07 11:09:09.119027')  [["published", true]]