6-12-2018/przemek/super-blog-przemek/app/controllers/home_controller.rb

SELECT "posts".* FROM "posts" WHERE (created_at BETWEEN '2018-11-07 09:03:34.081240' AND '2018-12-07 09:03:34.083118')
---
  def index
    @posts = Post.all