6-12-2018/przemek/super-blog-przemek/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "NewPostWO"], ["content", "orsds fsfs"], ["user_id", 1], ["created_at", "2018-12-07 08:34:53.438293"], ["updated_at", "2018-12-07 08:34:53.438293"]]

  def update
    # make it unable to edit someone else post
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "NewPostWO!!!!!"], ["updated_at", "2018-12-07 08:39:58.251282"], ["id", 6]]

  def destroy
    # make it unable to destroy someone else post
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]