6-12-2018/monika/super-blog-monika/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_user
    @post = Post.find(params[:id])

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "suchar"], ["content", "suchar Grzesia"], ["created_at", "2018-12-07 11:59:10.995379"], ["updated_at", "2018-12-07 11:59:10.995379"], ["user_id", 2]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save