6-12-2018/przemek/super-blog-przemek/app/views/posts/show.html.erb

<h3>Comments: </h3>
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]